backend/app/controllers/api/v1/holidays_controller.rb

SELECT "holidays".* FROM "holidays"
---
  def index
    @holidays = Holiday.all

INSERT INTO "holidays" ("title", "location", "google_map_url", "start_date", "end_date", "description", "created_at", "updated_at", "album_id", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @holiday = Holiday.new(holiday_params)

    if @holiday.save